{
    "TLL Design Guide": "I developed a comprehensive design guide for The Teaching Learning Lab, exploring what didgital content would look like if we used triangle pixles instead of square ones. This guide includes a custom font, color palettes, variety of differnt logo styles, and other visual elements to maintain a cohesive brand identity.",
    "A year in Review": "This is a documentary about my research working with immersive media over the 2023-2024 school year. It talks about the state of immersive technology, the value of 3D documentation and the potential risks that it and AI pose for the future.",
    "Power of Love": "\"The Power of Love\" is an interactive sculpture where the user is asked to type on key board with glue on push-pins on it. This piece explores the theme of love in a digital work, where through out all the advirsity, you can push through the pain, and reduce division.",
    "Interactive Sky Animation": "This conservation piece symbolizes the repercussions and impact of our interactions with nature. The player can interact with the birds using their mirrored silhouette, but the flock will only fly normally without human intervention.",
    "Pixel Manta Rays": "An interactive p5.js sketch featuring pixelated manta rays swimming in a dynamic ocean environment. This generative art piece uses Perlin noise to create procedural movement for the manta rays and the water, resulting in a unique and mesmerizing animation each time.",
    "technology is cyclical": "A half serious video essay that explores the actual cyclical nature of technology.",
    "Spaced Out": "A short animation that combined claymation, stop motion, green screening, in person video, programming, 3D scanning, 2d animation, music production, painting and clever video editing.",
    "Parallax city scape": "An interactive p5.js sketch of a parallax city scape. Use the arrow keys to fly through the city. This was one my first coding projects where I learned how to nest a for loop",
    "MAC Video Essay": "A half serious video essay that explores the actual cyclical nature of technology.",
    "Bossa Nova Boy": "This project explores what making a stream in the spirit of the Bossa Nova Girl music channel would be like, if I made it from a hodgepodge of object in my house and things I like from the internet.",
    "EPMO OFFICE": "Commissioned by Stony Brook University, this animated video was created to clearly visualize the functions and value of the Enterprise Project Management Office (EPMO). I led the project from concept to completion, handling the entire creative pipeline including storyboarding, illustration, sound design, music composition, and the final video editing.",
    "WUSB.FM": "As a intern for WUSB 90.1 FM, Stony Brook University's student radio station, I worked with Gerorge and Paul maintaining and updating the station's website. Were very close to releasing the new version of the website. You will not be able to see my work yet, but you can visit the official WUSB website here.",
    "LI History Journal": "In 2019-2020, I was responsible for revamping the website design to make it look more modern. I worked with the editorial team to create a user-friendly and visually appealing online presence for the journal.",
    "Envirodanger Website": "Originall in the early 2010s, this website began as a publicly accessible home for interviews and witness seminars on environmental dangers, but is now being transformed into a platform for stories, history, and teaching about environmental and climate justice, also the cumulative impacts and risks faced by environmental justice communities. Working with Christopher Sellers and Mark Chambers for the last 6 years, I've played a key role in the site's development, focusing on enhancing aesthetics and user navigation. I also implemented backend functionality that empowers professors to create diverse content easily. My most significant contribution was the 'visual transcript' system for witness seminars; this feature allows users to search the text and click on specific segments to jump directly to that timestamp in the video. Additionally, I developed a custom plugin that enables dynamic background image changes for individual pages.",
    "Remove the Sunglasses": "In the video on the left, I removed the sunglasses from the video on the right. This video was technical, requiring me to go back through the archives, trying to find the original assets, in which I would augment and juxtapose them together to look like the source video.",
    "Wall of Painting Bumper": "To give my Twitch stream a little extra flair, I designed this bumper to entertain viewers even when I'm away. It appears to be a static collage of portraits, but if you watch closely, you might catch some of the paintings blinking. I created the piece using OBS and Photoshop, and there are other Easter eggs hidden within. Keep your eyes peeled... can you find Goku?",
    "Pikachu overlay": "I spent a lot of time making overlays for my Twitch stream, here I masked and looped a few assets from the game Pokemon Channel",
    "Groundhogs Day": "An audio project inspired by my real experences being stuck in a time loop on Groundhog Day. /jk",
    "Nü": "An audio piece titled \"Nü\" inspired by the Crash Bandicoot games and their extensive use of the marimba",
    "H-beat": "An audio piece titled \"H-beat\". This was a song where I wanted to test my ability to make professional sounding track",
    "Grord Album Cover": "Album cover illustration for \"Grord\".",
    "Revamp of Blooms Taxonomy Wheel": "This is a modernized version of Bloom's Taxonomy Wheel I designed using my school's style guide.",
    "Faculty Flyer": "Back in 2019, I was asked to make a flyer for the Faculty Common's 1 year anniverary event, in which I modified my university's style to be more constructivist",
    "Hi Hat in Dough and tides not as so": "This image represents tic-tac-toe abstracted. The objective of the game is to get 3 words that all have the same letter. It's 2 player game where one player picks one word, and then another player picks one of the remaining words. The game ends when some one wins, or all of the words have been exhausted, meaning there are no more words to pick.",
    "3D Virtual Gallery": "This is a Virtual Gallery project I made for Nobuho Nagasawa's ARS 205 Ideas and Form class, to display her students projects. In this project Me and Paul St. Denis taught our student how to scan their work, using apps like Polycam and Scaniverse.",
    "Gsplat virtual Gallery": "This is my custom virtual gallery of my 3D scans, all of the scans are of places you can visit on Long Island.",
    "Isopod Dichotomous Key": "A project to help better visualize how to use a Dichotomous Key"
}