{"storymap": {"call_to_action": true, "call_to_action_text": "", "map_as_image": false, "map_type": "osm:standard", "slides": [{"date": "", "location": {"line": true}, "media": {"caption": "Dean Andrew Singer with CEAS students and their rocket in “The Space.”", "credit": "https://news.stonybrook.edu/", "url": "//uploads.knightlab.com/storymapjs/43ef07b73bec477df1dee2dc1d73a88b/maker-spaces-on-campus/_images/space-singer-students-rocket.jpg"}, "text": {"headline": "INNOVATION AND MAKER SPACES @ STONY BROOK UNIVERSITY", "text": "<p>Welcome to Stony Brook University, a campus where curiosity meets creation. We believe the most powerful ideas are the ones you can build, test, and share. This tour is your guide to our vibrant and diverse network of makerspaces, innovation hubs, and creative studios—each with a unique purpose, but all united by a common goal: <strong>to empower you to bring your vision to life</strong>.</p><p>Across our campus, we've cultivated an ecosystem where any idea can find a home. Whether you're an engineer ready to prototype a new device, an artist merging technology with critical expression, an educator designing the next generation of digital learning tools, or an entrepreneur with a groundbreaking concept, there is a space here for you. From 3D printers and laser cutters to VR studios and electronics labs, these facilities provide the tools and support to turn your concepts into tangible reality.</p><p>Each stop on this tour will introduce you to a unique community of creators, thinkers, and innovators. We invite you to discover the tools, find your collaborators, and get inspired.</p><p>Your journey from idea to impact starts now. <strong>Begin the tour to explore our spaces.</strong></p>"}, "type": "overview"}, {"date": "", "location": {"lat": 40.91325221667723, "line": true, "lon": -73.12463111738269, "zoom": 18}, "media": {"caption": "Alex Herrera with Associate Dean Robert Kukta (left) and Joe Shurz (right) in “The Space.”", "credit": "https://news.stonybrook.edu/university/the-space-is-a-place-for-ideas-beyond-the-classroom/", "url": "//uploads.knightlab.com/storymapjs/43ef07b73bec477df1dee2dc1d73a88b/maker-spaces-on-campus/_images/space-herrera-kukta-shurz-1.jpg"}, "text": {"headline": "The Space @ College of Engineering and Applied Sciences", "text": "<p>Welcome to <a href=\"https://sites.google.com/stonybrook.edu/the-space/home\" target=\"_blank\" rel=\"nofollow\">The Space</a>, run by <b>Joseph Schurz</b> and <b>Leah Gurtz</b>, the dedicated hub for hands-on innovation, built specifically for students in the College of Engineering and Applied Sciences (CEAS),. Located in Room 105 of the Engineering building, this is where your classroom learning transforms into practical creation.</p><p>Born from the vision of a recent CEAS graduate who saw the need for a dedicated creative outlet, The Space embodies a spirit of ingenuity, resilience, and limitless possibilities. It's designed to be a place where your classwork seamlessly intertwines with your personal projects, allowing you to bridge the gap between theory and practice.</p><p>Our workshop is equipped to support your journey from concept to completion with tools including:</p><ul><li><p><strong>3D Printers</strong> for prototyping and custom parts.</p></li><li><p>An <strong>Electronics Station</strong> for circuit design and testing.</p></li><li><p>A <strong>Vinyl Cutter</strong> for creating custom decals and stencils.</p></li><li><p>A full range of <strong>hand tools and dedicated building areas</strong>.</p></li></ul><p>To get started, CEAS students can sign up for our training workshops. Once trained, you'll have access to \"Open Space\" hours to reserve equipment, collaborate with teammates on senior design projects, or simply explore an idea that goes beyond the classroom. This is your place to experiment, innovate, and bring your engineering solutions to life.</p>"}}, {"date": "", "location": {"lat": 40.91538723745788, "line": true, "lon": -73.12233276016009, "zoom": 18}, "media": {"caption": "Concept art of what the The Innovation Lab might look like from the description", "credit": "Gemini", "url": "//uploads.knightlab.com/storymapjs/43ef07b73bec477df1dee2dc1d73a88b/maker-spaces-on-campus/_images/IMG_9840.jpeg"}, "text": {"headline": "The Innovation Lab @ Melville Library", "text": "<p>The Innovation Lab is Stony Brook University's dynamic hub for creativity, collaboration, and hands-on learning. Directed by<b> Jennifer Adams,</b> this is a space where ideas transform into reality. Whether you're an artist, an engineer, an entrepreneur, or just curious, our lab provides the tools and support you need to bring your vision to life.</p><p>Our goal is to foster an ecosystem of innovation that bridges the gap between abstract concepts and practical implementation. We believe in learning from experimentation, promoting creative risk-taking, and providing access to cutting-edge technology for all students. This space is designed to be an inclusive and accessible environment where diversity of thought and interdisciplinary collaboration thrive.<br><br></p><p>Here, you'll find a wide range of equipment at your fingertips, including:</p><ul><li><p><strong>3D Printers</strong> for rapid prototyping and custom designs.</p></li><li><p><strong>Laser Cutters</strong> for precise fabrication in wood, acrylic, and other materials.</p></li><li><p><strong>Textiles Equipment</strong> for projects in fashion, soft robotics, and wearable tech.</p></li><li><p><strong>Virtual Reality (VR)</strong> stations to explore and build immersive digital worlds.</p></li><li><p>A variety of <strong>hand and power tools</strong> for all your making needs.</p></li></ul><p>Step in, get inspired, and join a community dedicated to exploring the future of technology, scholarship, and creativity. We can't wait to see what you will make.</p>"}}, {"date": "", "location": {"lat": 40.915127152018144, "line": true, "lon": -73.12279523659512, "zoom": 18}, "media": {"caption": "Paul St. Denis Teaching High School Students Classical Logic In the VR Space in the Teaching and Learning Lab", "credit": "Liam Yehudai of the TLL", "url": "//uploads.knightlab.com/storymapjs/43ef07b73bec477df1dee2dc1d73a88b/maker-spaces-on-campus/_images/IMG_8987.PNG"}, "text": {"headline": "The Teaching & Learning Lab @ the melville Library", "text": "<p>Step into the digital frontier at the <a href=\"https://it.stonybrook.edu/services/teaching-learning-lab\" target=\"_blank\" rel=\"nofollow\">Teaching &amp; Learning Lab</a> (TLL), where education meets innovation, where teaching resources across the campus are made. This is not a space for hardware fabrication, but a creative studio dedicated to building the immersive digital experiences of tomorrow. Our mission is to collaborate with instructors and students to transform learning through the power of multimedia and interactive technology.</p><p>While other spaces on campus help you create physical objects, lead by<b> Paul St. Denis </b>the TLL is your hub for mastering the digital tools that bring ideas to life on screen. We provide the expertise and resources to elevate your projects, whether you're designing educational games, visualizing complex data, or exploring new dimensions in virtual reality.<br></p><p>Our lab is equipped with a powerful suite of software and cutting-edge electronics, including:</p><ul><li><p><strong>Expertise in a plethora of software</strong>, from the Adobe Creative Suite to 3D modeling with Blender and video editing with DaVinci Resolve.</p></li><li><p><strong>3D Scanners</strong> to capture real-world objects and bring them into the digital realm.</p></li><li><p><strong>Immersive VR Headsets</strong> for developing and experiencing virtual environments.</p></li><li><p><strong>High-resolution 3D Displays</strong> that add depth and interactivity to your presentations.</p></li></ul><p>Join us to develop custom animations, produce professional-quality videos, or build personalized learning experiences with AI. The Teaching &amp; Learning Lab is where your vision for a more engaging, inclusive, and accessible education becomes a reality.</p>"}}, {"date": "", "location": {"lat": 40.916105078726304, "line": true, "lon": -73.12113196583434, "zoom": 18}, "media": {"caption": "Art Department", "credit": "Stony Brook Maker Space", "url": "//uploads.knightlab.com/storymapjs/43ef07b73bec477df1dee2dc1d73a88b/maker-spaces-on-campus/_images/IMG_9828.jpeg"}, "text": {"headline": "The 3rd Space @ Staller Center", "text": "<p>Welcome to The 3rd Space, the Art Department's studio for mechatronic arts, digital fabrication, and critical making. Located in the Staller Center for the Arts, this is where technology is wielded not just as a tool, but as a medium for artistic inquiry and expression.</p><p>Under the guidance of <b>Dr. Esteban Agosin Otero,</b> a sound and electronic media artist, this space is dedicated to exploring the intersection of art, technology, and ecology. The philosophy here is rooted in experimentation and speculation. You'll be encouraged to take a critical approach—to remake, mutate, and give new life to found objects, questioning how technology can be used to observe and re-imagine our natural, social, and political environments.</p><p>This hybrid classroom and makerspace is equipped for creating projects that interact with the world in profound ways. Here you will learn to master:</p><ul><li><p><strong>Physical Computing</strong> with microcontrollers like Arduino, sensors, and actuators to build interactive systems.</p></li><li><p><strong>Digital Fabrication</strong> using 3D modeling software like Rhino and Tinkercad, brought to life with 3D printers.</p></li><li><p><strong>Creative Coding and Sound Design</strong> to integrate audio and custom programming into your work.</p></li></ul><p>In The 3rd Space, the goal is to develop unique artistic projects, whether they take the form of robotic objects, interactive installations, or dynamic media performances. This is a studio for artists ready to challenge boundaries and create work that provokes unexpected and meaningful outcomes.</p>"}}]}}